Revit 2024 API
TextNote.LeaderCount Property
 Number of leader objects currently attached to the text note.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public int LeaderCount { get; }
Visual Basic
Public ReadOnly Property LeaderCount As Integer
	Get
Visual C++
public:
property int LeaderCount {
	int get ();
}
See Also
TextNote Class
Autodesk.Revit.DB Namespace